Autodesk.Revit.UI.CommandMenuItem.SetAvailabilityClassName(System.String)
Set availabilityClassName of CommandMenuItem
Remarks:
The availability class name is the class which implements IExternalCommandAvailability interface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.CommandMenuItem.SetToolTip(System.String)
Set toolTip of CommandMenuItem
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.CommandMenuItem.#ctor(System.String,System.String,System.String)
Initialize the item data.
name:
The name will show on menu.
className:
The class name which implements IExternalCommand interface.
assemblyName:
The path of the assembly which contains the corresponding external command.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
className is an empty string or contains only whitespace.
-or-
assemblyName is an empty string or contains only whitespace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.CommandMenuItem
A class representing a single command menu item.
Remarks:
To add a menu item that can be executed, implement IExternalCommand interface and
pass external command class name to CommandMenuItem constructor, create the CommandMenuItem object and
use AddItem() method to add the object to context menu.
Since:
2025